myrottenpotatoes/app/controllers/movies_controller.rb

  def index
    @movies = Movie.order(:title)
---
SELECT "movies".* FROM "movies" ORDER BY "movies"."title" ASC

  def create
    if (@movie = Movie.create(movie_params))
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "T"], ["rating", "G"], ["description", nil], ["release_date", "2023-10-31 00:00:00"], ["created_at", "2023-10-31 01:22:13.195627"], ["updated_at", "2023-10-31 01:22:13.195627"]]

  def update
    @movie = Movie.find params[:id]
    if (@movie.update(movie_params))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "1973-04-25 00:00:00"], ["updated_at", "2023-11-28 23:00:01.740333"], ["id", 1]]